/*
 * Напиши скрипт який просить у користувача ввести число і степінь,
 * підводить число в цю степінь і виводить результат в консоль.
 */

// Алгоритм рішення:
// 1. Попросити користувача число - prompt() і записати значення в зміну base
// 2. Попросити користувача число - prompt() і записати значення в зміну power
// 3. Створити зміну і записати в неї результат підведення в степінь
// 4. Вивести результат в консоль

const num1 = prompt('Введіть числа 1');
const num2 = prompt('Введіть число 2');

const math = Math.pow(num1, num2);
console.log(math);

