//  Напиши скрипт підрахунку суми покупки зі знижкою в залежності від витраченої 
//   суми за весь час (партнерська програма).
 
//   - Загальна сума витрачених коштів зберігається в змінній totalSpent
//   - Сума поточного платежа зберігається в змінній payment
//   - Знижка зберігається в змінній discount
// - Якщо витрачено від [100 до 1000) - бронзовий партнер, знижка 2%
//     * - Якщо витрачено від [1000 до 5000) - срібний партнер, знижка 5%
//     * - Якщо витрачено більше [5000 - золотий партнер, знижка 10%
//     * - Якщо витрачено менше 100) - не партнер, знижка 0%
//     *
//     * - В результаті вивести повідомлення
//     * «Оформляемо замовлення на суму [сума] зі знижкою [знижка]%»
//     */
// const totalSpent = 2000;
// let payment = 500;
// let discount = 0;

// if (100 < totalSpent && totalSpent < 1000){
//     discount = 2;
//     payment -= payment * discount / 100;
//     alert(`бронзовий партнер, знижка 2%. До сплати = ${payment}`);
// } else if(1000 < totalSpent && totalSpent < 5000){
//     discount = 5;
//     payment -= payment * discount / 100;
//     alert(`бронзовий партнер, знижка 5%. До сплати = ${payment}`);
// } else if(totalSpent > 5000){
//     discount = 10;
//     payment -= payment * discount / 100;
//     alert(`бронзовий партнер, знижка 10%. До сплати = ${payment}`);
// } else if(totalSpent < 100){
//     alert(`не партнер, знижка 0%. До сплати = ${payment}`);
// }

// alert(`Оформляемо замовлення на суму ${payment} зі знижкою ${discount}%`);

// Використовуючи конструкцію if..else, напишіть код, що запитує:
//  ‘Яка “офіційна” назва JavaScript?’ Якщо відвідувач вводить
//   “ECMAScript”, виведіть “Правильно!”, в іншому випадку — виведіть:
//    “Ви не знаєте? ECMAScript!”

// const answer = prompt('Яка “офіційна” назва JavaScript?');

// if (answer === 'ECMAScript'){
//     console.log('Правильно');
// } else{
//     console.log('Ви не знаєте?');
// }

// Використовуючи if..else, напишіть код, що отримує число з інпуту
//  і потім виводить повідомлення на екран:
// 1, якщо значення більше нуля,
// -1, якщо меньше нуля,
// 0, якщо дорівнює нулю.
// Перепишіть конструкцію if, використовуючи умовний оператор '?':
// let result;
// if (a + b < 4) {
//   result = 'Нижче';
// } else {
//   result = 'Вище';
// }


// Творчі завдання
// напиши скрипт входження числа у відрізок зазначений в х1 та х2.
// до х1
// після х1
// від х1 до х2
// до х1 або після х2
// const x1 = 10;
// const x2 = 30;
// const number = 45;


// Напиши скрипт який перевіряє можливість відкрити чат з користувачем. Для цього користувач має бути:
// другом
// онлайн
// без режиму не турбувати
// const isOnline = false;
// const isFriend = true;
// const isDnd = false;


// Напиши скрипт перевірки підписки користувачапід час доступу до контенту. Єтри типи підпистки: free, pro та vip. Отримати доступ можуть тільки pro та vip.
// Напиши скрипт обробки покупки в магазині. 
//   1. Баланс користувача зберігається в змінній balance — отримати з інпуту
// Сумма покупки зберігається в змінній payment — отримати з інпуту
// Перед перевіркою вивести повідомлення на екран:
//   «Загальна вартість замовлення [число] кредитів. Перевіряємо кількість 
//   доступних коштів на рахунку»
// Якщо сума покупки не перевищує баланс:
// Відняти з балансу суму покупки
// Вивести повідомлення «На рахунку залишилося [число] кредитів»
// Якщо сума покупки перевищує баланс:
// Вивести повідомлення «На рахунку недостатньо коштів для проведення операції!»
// В кінці вивести повідомлення «Операція завершена»

